import streamlit as st

def intro():
    import streamlit as st

    st.write("""
        한양대학교의 교양교육은 매년 약 750개 전후의 다양한 교양과목을 개설하고 있습니다. 2023년 1학기를 기준으로 대다수의 교양과목은 1개의 분반만 개설되었습니다.
        
        가장 많은 분반이 개설된 과목은 "인공지능과기계학습" 과목은 9개의 분반이 개설되어 있어 인공지능 분야에 대한 높은 관심을 확인할 수 있습니다.
        
        교양영역은 가상대학영역, 일반영역, 소프트웨어영역, 인문과예술영역, 고전읽기영역, 과학과기술영역, 글로벌언어와문화영역, 미래산업과창업영역, 사회와세계영역으로 나뉘어져 있습니다. 

        2020-2023 교육과정의 세부 목표는 다음과 같다

        - 세부목표 1: 4차 산업혁명 관련 과목 필수이수 강화
        - 세부목표 2: 교양필수 교과목 교육과정 개편
        - 세부목표 3: 역량 기반, IC-PBL 및 융복합 교양교육 강화

        세부목표 1에 따라 2023년 1학기에 개설된 교양과목 중 "인공지능과기계학습" 과목이 9개의 분반으로 개설되어 있습니다. 이는 4차 산업혁명과 관련된 핵심 분야에 대한 수요가 크다는 것을 확인할 수 있습니다. 또한, 해당 교과목은 가상대학영역과 소프트웨어영역에 속하므로 다양한 분야에서의 필수 이수를 강화하고 있음을 시사합니다.

        다양한 교양과목에서 세부목표 3에 기반한 학생 참여형 인터캠퍼스 프로젝트 기반 학습(IC-PBL)이 강화되고 있는 것으로 나타났습니다. 이는 역량 기반 교육과 융복합 교육에 대한 관심이 높아지고 있다는 것을 의미합니다. 미래산업과창업영역, 사회와세계영역 등에서도 이러한 추세를 확인할 수 있었습니다. 따라서 현재 교양교육과 관련해 학교에서 추진한 세부 목표가 잘 추진되고 있는 것을 확인할 수 있었습니다.
        """)