import streamlit as st

def intro():
    import streamlit as st

    st.write("""
        고려대학교는 자유/정의/진리의 교육이념을 바탕으로 학문적 통찰력과 공감적 협업능력을 갖춰 세계 변화를 추동하는 실천적 인간의 형성을 목표로 교양교육을 디자인하였다.
        
        교양교육은 3가지 영역으로 구분된다.

        1. 공감적 인격교육
        2. 합리적 소통교육
        3. 성찰적 융합교육

        고려대학교 데이터는 교양필수 데이터만 수집되었으며, 홈페이지에서도 제한적으로 정보를 제공하고 있어 분석에 어려움이 있었다. 현재 고려대학교 교양필수 과목은 다음과 같다.

        1. 자유 정의 진리
        2. 글쓰기, 심화 글쓰기
        3. 핵심교양

        핵심교양은 다음 7개 세부영역으로 구분된다.
        1. 세계의 문화
        2. 역사의 탐구
        3. 윤리와 사상
        4. 문학과 예술
        5. 사회의 이해
        6. 과학과 기술
        7. 디지털 혁신과 인간
        """)