import streamlit as st
from PIL import Image
def show():
    st.title("결론")
    st.write("이와 같은 데이터 수집 과정을 통해 다양한 대학의 교양교육 과정에 대한 포괄적인 이해를 얻을 수 있었으며, 이는 향후 대학 교육 커리큘럼 개발 및 개선에 중요한 기초 자료로 활용될 수 있을 것입니다. 대학 교양교육의 현재 상태와 변화 추세를 이해함으로써, 학문 간 융합 및 창의적 사고를 강조하는 현대 교육의 방향성을 보다 명확하게 파악할 수 있게 되었습니다.")
    st.write("학생들에게 더 나은 교양교육을 제공하기 위해서는 다음 사항들을 고려하는 것이 중요합니다.")
    st.write("• 현대 사회와 산업의 변화에 맞추어 더 다양하고 유연한 교양과목을 제공하는 것.")
    st.write("• 학생들의 피드백과 요구 사항을 더 많이 반영하여 교양교육 프로그램을 개선하는 것.")
    st.write("• 학생들의 글로벌 경쟁력 강화를 위해 다국어 및 국제적 문화 이해에 대한 과목을 강화하는 것.")
    st.write("• 실용적인 기술과 지식을 강조하고, 학문 간의 경계를 넘나드는 융합 교육에 초점을 맞추는 것.")
    st.write("이러한 방향들은 학생들의 교양교육에 대한 만족도를 높이고, 졸업 후 사회 진출에 있어 필요한 역량을 키우는 데 도움이 될 것입니다.")

